### titanic.csv 파일을 이용해서 아래 문제1) ~ 문제4) 풀어 보세요.

'''
PassengerId(승객번호),Survived(생존여부:1-생존, 0-사망),Pclass(승선권 클래스:1-ㅣ1st, 2-2nd, 3-3rd),Name(승객이름),Sex(승객 성별),Age(승객 나이),SibSp(동반한 형제자매, 배우자 수),Parch(동반한 부모, 자식 수),Ticket(티켓의 고유 넘버),Fare(티켓의 요금),Cabin(객실 번호),Embarked(승선한 항구명: C-Cherbourg, !-Queenstown, S-Southampton)
'''

In [18]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [19]:
titanic = pd.read_csv('titanic.csv')
titanic

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [22]:
titanic.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

#### 문제1)  남자(male) 이면서 Pclass 가 1인 승객은 몇 명인가요?

In [23]:
cnt = titanic.loc[(titanic['Sex'] == 'male') & (titanic['Pclass'] == 1), 'PassengerId'].count()
cnt

122

####  문제2) 남자이면서 Pclass 가 1이고 Fare가 50 이상인 승객은 몇 명인가요?

In [24]:
cntm = titanic.loc[(titanic['Sex'] == 'male') & (titanic['Pclass'] == 1) & (titanic['Fare'] >= 50), 'PassengerId'].count()
cntm

58

#### 문제3) 새로운 열(sex_code)을 만들어서 남자인 경우는 코드 0, 여자인 경우는 1로 저장

In [29]:
sex_code = pd.DataFrame([0, 1], index = ['male', 'female'], columns = ['sex_code'])
sex_code

        sex_code
male           0
female         1

In [33]:
titanic2 = pd.merge(titanic, sex_code, left_on = 'Sex', right_index = True, how = 'inner')
titanic2

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,sex_code
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,0
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q,0
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S,0
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
880,881,1,2,"Shelley, Mrs. William (Imanita Parrish Hall)",female,25.0,0,1,230433,26.0000,NaN,S,1
882,883,0,3,"Dahlberg, Miss. Gerda Ulrika",female,22.0,0,0,7552,10.5167,NaN,S,1
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q,1
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,1
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,1

#### 문제4) 성별 생존자 수의 합(남자 생존자 수의 합, 여자 생존자수의 합) - 생존자는 Survived 의 값이 1인 것.

In [35]:
sv = titanic2.groupby('Sex')['Survived'].sum()

In [39]:
sv

Sex
female    233
male      109
Name: Survived, dtype: int64

### movies.csv, ratings.csv 파일을 이용하여 문제5) ~ 문제10)을 풀어 보세요.

In [61]:
import numpy as np
import pandas as pd

df_m = pd.read_csv('movies.csv')
df_r = pd.read_csv('ratings.csv')

df_m

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy
...,...,...,...
9737,193581,Black Butler: Book of the Atlantic (2017),Action|Animation|Comedy|Fantasy
9738,193583,No Game No Life: Zero (2017),Animation|Comedy|Fantasy
9739,193585,Flint (2017),Drama
9740,193587,Bungo Stray Dogs: Dead Apple (2018),Action|Animation
9741,193609,Andrew Dice Clay: Dice Rules (1991),Comedy

In [62]:
df_m.describe()

             movieId
count    9742.000000
mean    42200.353623
std     52160.494854
min         1.000000
25%      3248.250000
50%      7300.000000
75%     76232.000000
max    193609.000000

In [63]:
df_r

        userId  movieId  rating   timestamp
0            1        1     4.0   964982703
1            1        3     4.0   964981247
2            1        6     4.0   964982224
3            1       47     5.0   964983815
4            1       50     5.0   964982931
...        ...      ...     ...         ...
100831     610   166534     4.0  1493848402
100832     610   168248     5.0  1493850091
100833     610   168250     5.0  1494273047
100834     610   168252     5.0  1493846352
100835     610   170875     3.0  1493846415

[100836 rows x 4 columns]

In [64]:
df_r.describe()

              userId        movieId         rating     timestamp
count  100836.000000  100836.000000  100836.000000  1.008360e+05
mean      326.127564   19435.295718       3.501557  1.205946e+09
std       182.618491   35530.987199       1.042529  2.162610e+08
min         1.000000       1.000000       0.500000  8.281246e+08
25%       177.000000    1199.000000       3.000000  1.019124e+09
50%       325.000000    2991.000000       3.500000  1.186087e+09
75%       477.000000    8122.000000       4.000000  1.435994e+09
max       610.000000  193609.000000       5.000000  1.537799e+09

In [65]:
df_r.head()

   userId  movieId  rating  timestamp
0       1        1     4.0  964982703
1       1        3     4.0  964981247
2       1        6     4.0  964982224
3       1       47     5.0  964983815
4       1       50     5.0  964982931

#### 문제5) 사용자가 평가한 모든 영화의 전체 평균 평점을 출력 하세요.

In [66]:
df_r['rating'].mean()

3.501556983616962

#### 문제6) 각 사용자별 평균 평점을 출력 하세요.

In [67]:
df_r.groupby('userId')['rating'].mean()

userId
1      4.366379
2      3.948276
3      2.435897
4      3.555556
5      3.636364
         ...
606    3.657399
607    3.786096
608    3.134176
609    3.270270
610    3.688556
Name: rating, Length: 610, dtype: float64

#### 문제7) 각 영화 별 평균 평점을 movieid, title, 평균 평점 순으로 출력 하세요.

In [68]:
movie_mean = df_r.groupby('movieId')['rating'].mean()
result_df = movie_mean.to_frame()  
result_df.columns = ['average'] 
df = pd.merge(df_m, result_df, left_on = 'movieId', right_index = True, how = 'inner')
df[['movieId', 'title', 'average']]

      movieId                                      title   average
0           1                           Toy Story (1995)  3.920930
1           2                             Jumanji (1995)  3.431818
2           3                    Grumpier Old Men (1995)  3.259615
3           4                   Waiting to Exhale (1995)  2.357143
4           5         Father of the Bride Part II (1995)  3.071429
...       ...                                        ...       ...
9737   193581  Black Butler: Book of the Atlantic (2017)  4.000000
9738   193583               No Game No Life: Zero (2017)  3.500000
9739   193585                               Flint (2017)  3.500000
9740   193587        Bungo Stray Dogs: Dead Apple (2018)  3.500000
9741   193609        Andrew Dice Clay: Dice Rules (1991)  4.000000

[9724 rows x 3 columns]

#### 문제8) 평균 평점이 가장 높은 영화의 제목을 출력(동률인 경우 모두 출력) 하세요.

In [84]:
ch = df.loc[df['average'] == df['average'].max()]
ch

,movieId,title,genres,average
48,53,Lamerica (1994),Adventure|Drama,5.0
87,99,Heidi Fleiss: Hollywood Madam (1995),Documentary,5.0
121,148,"Awfully Big Adventure, An (1995)",Drama,5.0
405,467,Live Nude Girls (1995),Comedy,5.0
432,495,In the Realm of the Senses (Ai no corrida) (1976),Drama,5.0
...,...,...,...,...
9611,176601,Black Mirror,(no genres listed),5.0
9633,179133,Loving Vincent (2017),Animation|Crime|Drama,5.0
9634,179135,Blue Planet II (2017),Documentary,5.0
9688,184245,De platte jungle (1978),Documentary,5.0
9711,187717,Won't You Be My Neighbor? (2018),Documentary,5.0

In [85]:
print(ch['title'])

48                                        Lamerica (1994)
87                   Heidi Fleiss: Hollywood Madam (1995)
121                      Awfully Big Adventure, An (1995)
405                                Live Nude Girls (1995)
432     In the Realm of the Senses (Ai no corrida) (1976)
                              ...
9611                                         Black Mirror
9633                                Loving Vincent (2017)
9634                                Blue Planet II (2017)
9688                              De platte jungle (1978)
9711                     Won't You Be My Neighbor? (2018)
Name: title, Length: 296, dtype: object

#### 문제9) Comedy 영화 중 가장 평점이 낮은 영화 제목 출력(동률이 있는 경우 모두 출력) 하세요.

In [82]:
comedy = df.loc[df['genres'].str.contains('Comedy')]
cl = comedy.loc[comedy['average'] == comedy['average'].min()]
cl

,movieId,title,genres,average
4439,6557,Born to Be Wild (1995),Adventure|Children|Comedy|Drama,0.5
4881,7312,"Follow Me, Boys! (1966)",Comedy|Drama,0.5
5258,8632,Secret Society (2002),Comedy,0.5
5409,25782,Boudu Saved From Drowning (Boudu sauvé des eau...,Comedy,0.5
5453,26095,"Carabineers, The (Carabiniers, Les) (1963)",Comedy|Drama|War,0.5
5662,27595,Jesus Christ Vampire Hunter (2001),Action|Comedy|Horror|Musical,0.5
5777,31422,Are We There Yet? (2005),Children|Comedy,0.5
5795,31692,Uncle Nino (2003),Comedy,0.5
6160,44243,Leprechaun 4: In Space (1997),Comedy|Fantasy|Horror|Sci-Fi,0.5
6545,54768,Daddy Day Camp (2007),Children|Comedy,0.5
6554,54934,"Brothers Solomon, The (2007)",Comedy,0.5
6784,60363,Zombie Strippers! (2008),Comedy|Horror,0.5
7201,72696,Old Dogs (2009),Comedy,0.5
7553,85334,Hard Ticket to Hawaii (1987),Action|Comedy,0.5
7762,91414,Arthur Christmas (2011),Animation|Children|Comedy|Drama,0.5
7820,92681,Journey 2: The Mysterious Island (2012),Action|Adventure|Comedy|Sci-Fi|IMAX,0.5
8248,104644,Maria Bamford: The Special Special Special! (2...,Comedy,0.5
8417,110773,"Haunted House 2, A (2014)",Comedy|Horror,0.5
8676,122246,Tooth Fairy 2 (2012),Children|Comedy,0.5
8893,134528,Aloha (2015),Comedy|Drama|Romance,0.5
8908,135216,The Star Wars Holiday Special (1978),Adventure|Children|Comedy|Sci-Fi,0.5
8984,138798,Joe Dirt 2: Beautiful Loser (2015),Comedy,0.5
9056,141994,Saving Christmas (2014),Children|Comedy,0.5
9419,165645,Bad Santa 2 (2016),Comedy,0.5
9590,175475,The Emoji Movie (2017),Animation|Children|Comedy,0.5

In [83]:
print(cl['title'])

4439                               Born to Be Wild (1995)
4881                              Follow Me, Boys! (1966)
5258                                Secret Society (2002)
5409    Boudu Saved From Drowning (Boudu sauvé des eau...
5453           Carabineers, The (Carabiniers, Les) (1963)
5662                   Jesus Christ Vampire Hunter (2001)
5777                             Are We There Yet? (2005)
5795                                    Uncle Nino (2003)
6160                        Leprechaun 4: In Space (1997)
6545                                Daddy Day Camp (2007)
6554                         Brothers Solomon, The (2007)
6784                             Zombie Strippers! (2008)
7201                                      Old Dogs (2009)
7553                         Hard Ticket to Hawaii (1987)
7762                              Arthur Christmas (2011)
7820              Journey 2: The Mysterious Island (2012)
8248    Maria Bamford: The Special Special Special! (2...
8417                            Haunted House 2, A (2014)
8676                                 Tooth Fairy 2 (2012)
8893                                         Aloha (2015)
8908                 The Star Wars Holiday Special (1978)
8984                   Joe Dirt 2: Beautiful Loser (2015)
9056                              Saving Christmas (2014)
9419                                   Bad Santa 2 (2016)
9590                               The Emoji Movie (2017)
Name: title, dtype: object

#### 문제10) 2015년도에 평가된 모든 Romance 영화의 평균 평점을 구하세요.

In [72]:
import time

In [88]:
df_2 = pd.merge(df_m, df_r, left_on = 'movieId', right_on = 'movieId', how = 'inner')
result = df_2.loc[df_2['genres'].str.contains('Romance')]

start = time.mktime(time.strptime('2015-01-01 00:00:00', '%Y-%m-%d %H:%M:%S'))
end = time.mktime(time.strptime('2016-01-01 00:00:00', '%Y-%m-%d %H:%M:%S'))
print(result.loc[(result['timestamp'] >= start) & (result['timestamp'] < end), 'rating'].mean())

3.396375098502758